blog/backend/views/post/_form.php

    <?= $form->field($model, 'tags')->textarea(['rows' => 6]) ?>
     <?php

     $allstatus=Poststatus::find()->select(['name','id'])->from('poststatus')->indexBy('id')->column();
---
SELECT `name`, `id` FROM `poststatus`

    <?= $form->field($model, 'update_time')->textInput() ?>

 <?php
     $author=Adminuser::find()->all();
---
SELECT * FROM `adminuser`