blog/backend/views/post/index.php

SELECT `name`, `id` FROM `poststatus` ORDER BY `position`
---
            //'content:ntext',
            'tags:ntext',
            //'status',
            ['attribute'=>'status','value'=>'status0.name',
            'filter'=>PostStatus::find()->select(['name','id'])->orderBy('position')->indexBy('id')->column()],