blog/common/models/Adminuser.php

SELECT * FROM `adminuser` WHERE `id`=1
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id]);

SELECT * FROM `adminuser` WHERE `username`='weixi'
---
    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, ]);