blog/common/models/Comment.php

    public function approve()
    {
        $this->status = 2; //设置评论状态为已审核
        return ($this->save()?true:false);
---
UPDATE `comment` SET `status`=2 WHERE `id`=103

    public static function getPengdingCommentCount()
    {
        return Comment::find()->where(['status'=>1])->count();
---
SELECT COUNT(*) FROM `comment` WHERE `status`=1