blog/backend/controllers/CommentController.php

    protected function findModel($id)
    {
        if (($model = Comment::findOne($id)) !== null) {
---
SELECT * FROM `comment` WHERE `id`='103'