blog/backend/controllers/PostController.php

SELECT * FROM `post` WHERE `id`='32'
---
    protected function findModel($id)
    {
        if (($model = Post::findOne($id)) !== null) {